app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `live` = 'Yes'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `gender_preference` = 'male'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `gender_preference` = 'female'
---
    public function home()
    {
        $userModel = new UserModel();
        $data['count'] = $userModel->countAllResults();
        $data['live'] = $userModel->where(["live" => "Yes"])->countAllResults();
        $data['male'] = $userModel->where(["gender_preference" => "male"])->countAllResults();
        $data['female'] = $userModel->where(["gender_preference" => "female"])->countAllResults();