app/Controllers/UserCrud.php

    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` ASC

    public function singleUser($id = null){
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1

    public function detail($id = null){
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1

    public function delete($id = null){
        $userModel = new UserModel();
        $data['user'] = $userModel->where('id', $id)->delete($id);
---
DELETE FROM `users`
WHERE `id` = '6'
AND `id` IN ('6')